TP1/test_runs/load/ping/many/artillery_output.txt
Phase started: WarmUp (index: 0, duration: 30s) 06:59:10(-0300)

--------------------------------------
Metrics for period to: 06:59:20(-0300) (width: 8.014s)
--------------------------------------

http.codes.200: ................................................................ 45
http.request_rate: ............................................................. 5/sec
http.requests: ................................................................. 45
http.response_time:
  min: ......................................................................... 0
  max: ......................................................................... 30
  median: ...................................................................... 3
  p95: ......................................................................... 10.9
  p99: ......................................................................... 19.9
http.responses: ................................................................ 45
vusers.completed: .............................................................. 45
vusers.created: ................................................................ 45
vusers.created_by_name.ping: ................................................... 45
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 3.9
  max: ......................................................................... 57.1
  median: ...................................................................... 8.8
  p95: ......................................................................... 36.2
  p99: ......................................................................... 53


Phase completed: WarmUp (index: 0, duration: 30s) 06:59:40(-0300)

Phase started: RampUp (index: 1, duration: 30s) 06:59:40(-0300)

--------------------------------------
Metrics for period to: 06:59:30(-0300) (width: 9.007s)
--------------------------------------

http.codes.200: ................................................................ 50
http.request_rate: ............................................................. 5/sec
http.requests: ................................................................. 50
http.response_time:
  min: ......................................................................... 1
  max: ......................................................................... 9
  median: ...................................................................... 3
  p95: ......................................................................... 5
  p99: ......................................................................... 7.9
http.responses: ................................................................ 50
vusers.completed: .............................................................. 50
vusers.created: ................................................................ 50
vusers.created_by_name.ping: ................................................... 50
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 4
  max: ......................................................................... 12.4
  median: ...................................................................... 6.6
  p95: ......................................................................... 10.7
  p99: ......................................................................... 11.1


--------------------------------------
Metrics for period to: 06:59:40(-0300) (width: 9.007s)
--------------------------------------

http.codes.200: ................................................................ 50
http.request_rate: ............................................................. 5/sec
http.requests: ................................................................. 50
http.response_time:
  min: ......................................................................... 1
  max: ......................................................................... 8
  median: ...................................................................... 3
  p95: ......................................................................... 5
  p99: ......................................................................... 6
http.responses: ................................................................ 50
vusers.completed: .............................................................. 50
vusers.created: ................................................................ 50
vusers.created_by_name.ping: ................................................... 50
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 3.4
  max: ......................................................................... 10.7
  median: ...................................................................... 5.1
  p95: ......................................................................... 9.1
  p99: ......................................................................... 9.9


--------------------------------------
Metrics for period to: 06:59:50(-0300) (width: 9.605s)
--------------------------------------

http.codes.200: ................................................................ 100
http.request_rate: ............................................................. 11/sec
http.requests: ................................................................. 100
http.response_time:
  min: ......................................................................... 0
  max: ......................................................................... 4
  median: ...................................................................... 2
  p95: ......................................................................... 3
  p99: ......................................................................... 4
http.responses: ................................................................ 100
vusers.completed: .............................................................. 100
vusers.created: ................................................................ 100
vusers.created_by_name.ping: ................................................... 100
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 2.5
  max: ......................................................................... 36.2
  median: ...................................................................... 4.1
  p95: ......................................................................... 6.9
  p99: ......................................................................... 33.5


--------------------------------------
Metrics for period to: 07:00:00(-0300) (width: 9.859s)
--------------------------------------

http.codes.200: ................................................................ 179
http.request_rate: ............................................................. 18/sec
http.requests: ................................................................. 179
http.response_time:
  min: ......................................................................... 0
  max: ......................................................................... 8
  median: ...................................................................... 2
  p95: ......................................................................... 5
  p99: ......................................................................... 7
http.responses: ................................................................ 179
vusers.completed: .............................................................. 179
vusers.created: ................................................................ 179
vusers.created_by_name.ping: ................................................... 179
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 2.6
  max: ......................................................................... 18.2
  median: ...................................................................... 4.4
  p95: ......................................................................... 11.1
  p99: ......................................................................... 12.6


Phase completed: RampUp (index: 1, duration: 30s) 07:00:11(-0300)

Phase started: Plain (index: 2, duration: 120s) 07:00:11(-0300)

--------------------------------------
Metrics for period to: 07:00:10(-0300) (width: 9.858s)
--------------------------------------

http.codes.200: ................................................................ 280
http.request_rate: ............................................................. 30/sec
http.requests: ................................................................. 280
http.response_time:
  min: ......................................................................... 0
  max: ......................................................................... 12
  median: ...................................................................... 2
  p95: ......................................................................... 6
  p99: ......................................................................... 7
http.responses: ................................................................ 280
vusers.completed: .............................................................. 280
vusers.created: ................................................................ 280
vusers.created_by_name.ping: ................................................... 280
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 2.4
  max: ......................................................................... 17.2
  median: ...................................................................... 4.8
  p95: ......................................................................... 9.7
  p99: ......................................................................... 13.3


--------------------------------------
Metrics for period to: 07:00:20(-0300) (width: 9.855s)
--------------------------------------

http.codes.200: ................................................................ 293
http.request_rate: ............................................................. 30/sec
http.requests: ................................................................. 293
http.response_time:
  min: ......................................................................... 0
  max: ......................................................................... 10
  median: ...................................................................... 2
  p95: ......................................................................... 5
  p99: ......................................................................... 7
http.responses: ................................................................ 293
vusers.completed: .............................................................. 293
vusers.created: ................................................................ 293
vusers.created_by_name.ping: ................................................... 293
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 2.4
  max: ......................................................................... 20
  median: ...................................................................... 4.5
  p95: ......................................................................... 11.6
  p99: ......................................................................... 16.6


--------------------------------------
Metrics for period to: 07:00:30(-0300) (width: 9.856s)
--------------------------------------

http.codes.200: ................................................................ 300
http.request_rate: ............................................................. 30/sec
http.requests: ................................................................. 300
http.response_time:
  min: ......................................................................... 0
  max: ......................................................................... 18
  median: ...................................................................... 2
  p95: ......................................................................... 6
  p99: ......................................................................... 10.9
http.responses: ................................................................ 300
vusers.completed: .............................................................. 300
vusers.created: ................................................................ 300
vusers.created_by_name.ping: ................................................... 300
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 2.3
  max: ......................................................................... 42
  median: ...................................................................... 5
  p95: ......................................................................... 12.6
  p99: ......................................................................... 26.8


--------------------------------------
Metrics for period to: 07:00:40(-0300) (width: 9.863s)
--------------------------------------

http.codes.200: ................................................................ 300
http.request_rate: ............................................................. 30/sec
http.requests: ................................................................. 300
http.response_time:
  min: ......................................................................... 0
  max: ......................................................................... 31
  median: ...................................................................... 2
  p95: ......................................................................... 7
  p99: ......................................................................... 29.1
http.responses: ................................................................ 300
vusers.completed: .............................................................. 300
vusers.created: ................................................................ 300
vusers.created_by_name.ping: ................................................... 300
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 2.4
  max: ......................................................................... 76.7
  median: ...................................................................... 5
  p95: ......................................................................... 29.1
  p99: ......................................................................... 34.1


--------------------------------------
Metrics for period to: 07:00:50(-0300) (width: 9.849s)
--------------------------------------

http.codes.200: ................................................................ 300
http.request_rate: ............................................................. 30/sec
http.requests: ................................................................. 300
http.response_time:
  min: ......................................................................... 0
  max: ......................................................................... 40
  median: ...................................................................... 2
  p95: ......................................................................... 25.8
  p99: ......................................................................... 32.1
http.responses: ................................................................ 300
vusers.completed: .............................................................. 300
vusers.created: ................................................................ 300
vusers.created_by_name.ping: ................................................... 300
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 2.2
  max: ......................................................................... 84.2
  median: ...................................................................... 5.9
  p95: ......................................................................... 33.5
  p99: ......................................................................... 48.9


--------------------------------------
Metrics for period to: 07:01:00(-0300) (width: 9.856s)
--------------------------------------

http.codes.200: ................................................................ 300
http.request_rate: ............................................................. 30/sec
http.requests: ................................................................. 300
http.response_time:
  min: ......................................................................... 0
  max: ......................................................................... 42
  median: ...................................................................... 2
  p95: ......................................................................... 22
  p99: ......................................................................... 32.1
http.responses: ................................................................ 300
vusers.completed: .............................................................. 300
vusers.created: ................................................................ 300
vusers.created_by_name.ping: ................................................... 300
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 2.3
  max: ......................................................................... 43.5
  median: ...................................................................... 5.2
  p95: ......................................................................... 31.5
  p99: ......................................................................... 38.5


--------------------------------------
Metrics for period to: 07:01:10(-0300) (width: 9.859s)
--------------------------------------

http.codes.200: ................................................................ 300
http.request_rate: ............................................................. 30/sec
http.requests: ................................................................. 300
http.response_time:
  min: ......................................................................... 0
  max: ......................................................................... 38
  median: ...................................................................... 3
  p95: ......................................................................... 27.9
  p99: ......................................................................... 36.2
http.responses: ................................................................ 300
vusers.completed: .............................................................. 300
vusers.created: ................................................................ 300
vusers.created_by_name.ping: ................................................... 300
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 2.1
  max: ......................................................................... 42.1
  median: ...................................................................... 5.4
  p95: ......................................................................... 32.1
  p99: ......................................................................... 39.3


--------------------------------------
Metrics for period to: 07:01:20(-0300) (width: 9.854s)
--------------------------------------

http.codes.200: ................................................................ 300
http.request_rate: ............................................................. 30/sec
http.requests: ................................................................. 300
http.response_time:
  min: ......................................................................... 0
  max: ......................................................................... 32
  median: ...................................................................... 2
  p95: ......................................................................... 7.9
  p99: ......................................................................... 29.1
http.responses: ................................................................ 300
vusers.completed: .............................................................. 300
vusers.created: ................................................................ 300
vusers.created_by_name.ping: ................................................... 300
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 2.3
  max: ......................................................................... 47.3
  median: ...................................................................... 5.1
  p95: ......................................................................... 29.7
  p99: ......................................................................... 34.1


--------------------------------------
Metrics for period to: 07:01:30(-0300) (width: 9.858s)
--------------------------------------

http.codes.200: ................................................................ 300
http.request_rate: ............................................................. 30/sec
http.requests: ................................................................. 300
http.response_time:
  min: ......................................................................... 0
  max: ......................................................................... 39
  median: ...................................................................... 2
  p95: ......................................................................... 25.8
  p99: ......................................................................... 37.7
http.responses: ................................................................ 300
vusers.completed: .............................................................. 300
vusers.created: ................................................................ 300
vusers.created_by_name.ping: ................................................... 300
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 2.2
  max: ......................................................................... 51.3
  median: ...................................................................... 5.3
  p95: ......................................................................... 32.1
  p99: ......................................................................... 40


--------------------------------------
Metrics for period to: 07:01:40(-0300) (width: 9.862s)
--------------------------------------

http.codes.200: ................................................................ 300
http.request_rate: ............................................................. 30/sec
http.requests: ................................................................. 300
http.response_time:
  min: ......................................................................... 0
  max: ......................................................................... 43
  median: ...................................................................... 2
  p95: ......................................................................... 25.8
  p99: ......................................................................... 40
http.responses: ................................................................ 300
vusers.completed: .............................................................. 300
vusers.created: ................................................................ 300
vusers.created_by_name.ping: ................................................... 300
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 2.8
  max: ......................................................................... 66.2
  median: ...................................................................... 5.2
  p95: ......................................................................... 34.8
  p99: ......................................................................... 43.4


--------------------------------------
Metrics for period to: 07:01:50(-0300) (width: 9.854s)
--------------------------------------

http.codes.200: ................................................................ 300
http.request_rate: ............................................................. 30/sec
http.requests: ................................................................. 300
http.response_time:
  min: ......................................................................... 0
  max: ......................................................................... 31
  median: ...................................................................... 2
  p95: ......................................................................... 6
  p99: ......................................................................... 10.9
http.responses: ................................................................ 300
vusers.completed: .............................................................. 300
vusers.created: ................................................................ 300
vusers.created_by_name.ping: ................................................... 300
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 2.3
  max: ......................................................................... 33.3
  median: ...................................................................... 4.9
  p95: ......................................................................... 12.1
  p99: ......................................................................... 29.7


--------------------------------------
Metrics for period to: 07:02:00(-0300) (width: 9.843s)
--------------------------------------

http.codes.200: ................................................................ 300
http.request_rate: ............................................................. 30/sec
http.requests: ................................................................. 300
http.response_time:
  min: ......................................................................... 0
  max: ......................................................................... 52
  median: ...................................................................... 2
  p95: ......................................................................... 12.1
  p99: ......................................................................... 30.3
http.responses: ................................................................ 300
vusers.completed: .............................................................. 300
vusers.created: ................................................................ 300
vusers.created_by_name.ping: ................................................... 300
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 2.3
  max: ......................................................................... 54.7
  median: ...................................................................... 5.2
  p95: ......................................................................... 24.3
  p99: ......................................................................... 47.9


Phase completed: Plain (index: 2, duration: 120s) 07:02:11(-0300)

Phase started: Cleanup (index: 3, duration: 30s) 07:02:11(-0300)

--------------------------------------
Metrics for period to: 07:02:10(-0300) (width: 9.856s)
--------------------------------------

http.codes.200: ................................................................ 300
http.request_rate: ............................................................. 30/sec
http.requests: ................................................................. 300
http.response_time:
  min: ......................................................................... 0
  max: ......................................................................... 50
  median: ...................................................................... 2
  p95: ......................................................................... 26.8
  p99: ......................................................................... 47.9
http.responses: ................................................................ 300
vusers.completed: .............................................................. 300
vusers.created: ................................................................ 300
vusers.created_by_name.ping: ................................................... 300
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 2.2
  max: ......................................................................... 51.2
  median: ...................................................................... 5.8
  p95: ......................................................................... 33.5
  p99: ......................................................................... 48.9


--------------------------------------
Metrics for period to: 07:02:20(-0300) (width: 1.266s)
--------------------------------------

http.codes.200: ................................................................ 44
http.request_rate: ............................................................. 37/sec
http.requests: ................................................................. 44
http.response_time:
  min: ......................................................................... 1
  max: ......................................................................... 27
  median: ...................................................................... 3
  p95: ......................................................................... 6
  p99: ......................................................................... 25.8
http.responses: ................................................................ 44
vusers.completed: .............................................................. 44
vusers.created: ................................................................ 44
vusers.created_by_name.ping: ................................................... 44
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 2.9
  max: ......................................................................... 54.3
  median: ...................................................................... 5.1
  p95: ......................................................................... 33.5
  p99: ......................................................................... 45.2


Phase completed: Cleanup (index: 3, duration: 30s) 07:02:41(-0300)

All VUs finished. Total time: 3 minutes, 33 seconds

--------------------------------
Summary report @ 07:02:42(-0300)
--------------------------------

http.codes.200: ................................................................ 4341
http.request_rate: ............................................................. 25/sec
http.requests: ................................................................. 4341
http.response_time:
  min: ......................................................................... 0
  max: ......................................................................... 52
  median: ...................................................................... 2
  p95: ......................................................................... 8.9
  p99: ......................................................................... 30.3
http.responses: ................................................................ 4341
vusers.completed: .............................................................. 4341
vusers.created: ................................................................ 4341
vusers.created_by_name.ping: ................................................... 4341
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 2.1
  max: ......................................................................... 84.2
  median: ...................................................................... 5.1
  p95: ......................................................................... 29.7
  p99: ......................................................................... 40.9